benchmark/io/results/WD3200BEKX_RAID10x4_LVM-E5506.out
seq-write: (g=0): rw=write, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=128
seq-read: (g=1): rw=read, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=128
seq-rw: (g=2): rw=rw, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=128
rand-write: (g=3): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
rand-read: (g=4): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
rand-rw: (g=5): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
threaded-write: (g=6): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-read: (g=7): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-rw: (g=8): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-rw-pareto: (g=9): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-80-20: (g=10): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
streaming-write: (g=11): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
streaming-read: (g=12): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
streaming-rw: (g=13): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
fio-2.1.10
Starting 134 processes

seq-write: (groupid=0, jobs=1): err= 0: pid=10115: Wed Dec 10 12:42:48 2014
  write: io=52476MB, bw=177386KB/s, iops=42, runt=302929msec
    slat (msec): min=1, max=1473, avg=11.56, stdev=78.51
    clat (msec): min=2037, max=5350, avg=2956.00, stdev=225.77
     lat (msec): min=2038, max=5352, avg=2967.66, stdev=231.02
    clat percentiles (msec):
     |  1.00th=[ 2573],  5.00th=[ 2769], 10.00th=[ 2835], 20.00th=[ 2868],
     | 30.00th=[ 2868], 40.00th=[ 2900], 50.00th=[ 2933], 60.00th=[ 2966],
     | 70.00th=[ 2999], 80.00th=[ 3032], 90.00th=[ 3097], 95.00th=[ 3130],
     | 99.00th=[ 3884], 99.50th=[ 4490], 99.90th=[ 5342], 99.95th=[ 5342],
     | 99.99th=[ 5342]
    bw (KB  /s): min=  408, max=457788, per=100.00%, avg=220104.56, stdev=157708.77
    lat (msec) : >=2000=100.98%
  cpu          : usr=5.96%, sys=2.10%, ctx=55186, majf=0, minf=25
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=103.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=12992/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
seq-read: (groupid=1, jobs=1): err= 0: pid=11126: Wed Dec 10 12:42:48 2014
  read : io=78288MB, bw=266560KB/s, iops=64, runt=300746msec
    slat (usec): min=367, max=345403, avg=15270.44, stdev=37505.97
    clat (msec): min=646, max=4392, avg=1954.02, stdev=477.01
     lat (msec): min=732, max=4393, avg=1969.41, stdev=481.67
    clat percentiles (msec):
     |  1.00th=[  881],  5.00th=[ 1090], 10.00th=[ 1319], 20.00th=[ 1516],
     | 30.00th=[ 1631], 40.00th=[ 1762], 50.00th=[ 1958], 60.00th=[ 2376],
     | 70.00th=[ 2442], 80.00th=[ 2442], 90.00th=[ 2442], 95.00th=[ 2442],
     | 99.00th=[ 2606], 99.50th=[ 2671], 99.90th=[ 2802], 99.95th=[ 2900],
     | 99.99th=[ 3359]
    bw (KB  /s): min=  407, max=532480, per=98.68%, avg=263046.97, stdev=91223.67
    lat (msec) : 750=0.03%, 1000=3.39%, 2000=48.37%, >=2000=48.86%
  cpu          : usr=0.02%, sys=2.81%, ctx=3357, majf=0, minf=797
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.3%, >=64=103.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=19445/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
seq-rw: (groupid=2, jobs=1): err= 0: pid=11830: Wed Dec 10 12:42:48 2014
  read : io=30212MB, bw=102310KB/s, iops=24, runt=302385msec
    slat (usec): min=351, max=1337.8K, avg=21459.14, stdev=89239.38
    clat (msec): min=19, max=3795, avg=726.51, stdev=364.71
     lat (msec): min=20, max=3795, avg=748.10, stdev=373.43
    clat percentiles (msec):
     |  1.00th=[   56],  5.00th=[  233], 10.00th=[  363], 20.00th=[  465],
     | 30.00th=[  537], 40.00th=[  603], 50.00th=[  676], 60.00th=[  750],
     | 70.00th=[  832], 80.00th=[  955], 90.00th=[ 1172], 95.00th=[ 1385],
     | 99.00th=[ 1762], 99.50th=[ 1926], 99.90th=[ 3523], 99.95th=[ 3523],
     | 99.99th=[ 3785]
    bw (KB  /s): min=  382, max=350852, per=100.00%, avg=111431.55, stdev=57488.95
  write: io=30896MB, bw=104627KB/s, iops=25, runt=302385msec
    slat (msec): min=1, max=774, avg= 5.48, stdev=43.17
    clat (msec): min=2692, max=7870, avg=4320.45, stdev=458.26
     lat (msec): min=2693, max=7871, avg=4325.98, stdev=459.80
    clat percentiles (msec):
     |  1.00th=[ 3326],  5.00th=[ 3654], 10.00th=[ 3785], 20.00th=[ 3982],
     | 30.00th=[ 4080], 40.00th=[ 4228], 50.00th=[ 4293], 60.00th=[ 4424],
     | 70.00th=[ 4555], 80.00th=[ 4686], 90.00th=[ 4883], 95.00th=[ 5014],
     | 99.00th=[ 5407], 99.50th=[ 6259], 99.90th=[ 7111], 99.95th=[ 7439],
     | 99.99th=[ 7898]
    bw (KB  /s): min= 2310, max=435744, per=100.00%, avg=120391.32, stdev=92773.77
    lat (msec) : 20=0.01%, 50=0.44%, 100=0.44%, 250=1.80%, 500=9.78%
    lat (msec) : 750=17.72%, 1000=11.17%, 2000=8.32%, >=2000=51.16%
  cpu          : usr=2.15%, sys=2.31%, ctx=19321, majf=0, minf=26
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=103.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=7536/w=7614/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
rand-write: (groupid=3, jobs=1): err= 0: pid=12433: Wed Dec 10 12:42:48 2014
  write: io=244852KB, bw=833968B/s, iops=203, runt=300645msec
    slat (usec): min=5, max=310, avg=13.01, stdev= 9.12
    clat (msec): min=277, max=1232, avg=629.36, stdev=51.66
     lat (msec): min=277, max=1232, avg=629.37, stdev=51.66
    clat percentiles (msec):
     |  1.00th=[  469],  5.00th=[  578], 10.00th=[  586], 20.00th=[  603],
     | 30.00th=[  611], 40.00th=[  619], 50.00th=[  627], 60.00th=[  635],
     | 70.00th=[  644], 80.00th=[  660], 90.00th=[  676], 95.00th=[  701],
     | 99.00th=[  766], 99.50th=[  865], 99.90th=[  988], 99.95th=[ 1172],
     | 99.99th=[ 1172]
    bw (KB  /s): min=    0, max= 1000, per=100.00%, avg=815.45, stdev=78.02
    lat (msec) : 500=1.18%, 750=97.88%, 1000=1.05%, 2000=0.10%
  cpu          : usr=0.13%, sys=0.40%, ctx=31141, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=61086/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
rand-read: (groupid=4, jobs=1): err= 0: pid=13440: Wed Dec 10 12:42:48 2014
  write: io=244776KB, bw=834042B/s, iops=203, runt=300525msec
    slat (usec): min=5, max=380, avg=12.32, stdev= 8.90
    clat (msec): min=270, max=1063, avg=629.46, stdev=47.06
     lat (msec): min=270, max=1063, avg=629.47, stdev=47.06
    clat percentiles (msec):
     |  1.00th=[  545],  5.00th=[  578], 10.00th=[  586], 20.00th=[  603],
     | 30.00th=[  611], 40.00th=[  619], 50.00th=[  627], 60.00th=[  635],
     | 70.00th=[  644], 80.00th=[  660], 90.00th=[  676], 95.00th=[  701],
     | 99.00th=[  766], 99.50th=[  816], 99.90th=[ 1012], 99.95th=[ 1012],
     | 99.99th=[ 1012]
    bw (KB  /s): min=    0, max=  998, per=100.00%, avg=815.24, stdev=69.73
    lat (msec) : 500=0.85%, 750=98.18%, 1000=1.06%, 2000=0.11%
  cpu          : usr=0.11%, sys=0.40%, ctx=31541, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=61067/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
rand-rw: (groupid=5, jobs=1): err= 0: pid=14007: Wed Dec 10 12:42:48 2014
  read : io=167412KB, bw=570727B/s, iops=139, runt=300371msec
    slat (usec): min=5, max=312, avg=20.72, stdev=10.38
    clat (usec): min=237, max=718097, avg=189322.85, stdev=133117.68
     lat (usec): min=263, max=718113, avg=189343.97, stdev=133114.78
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   10], 10.00th=[   14], 20.00th=[   36],
     | 30.00th=[   72], 40.00th=[  119], 50.00th=[  219], 60.00th=[  260],
     | 70.00th=[  289], 80.00th=[  318], 90.00th=[  355], 95.00th=[  383],
     | 99.00th=[  445], 99.50th=[  465], 99.90th=[  529], 99.95th=[  553],
     | 99.99th=[  635]
    bw (KB  /s): min=    0, max=  896, per=100.00%, avg=565.28, stdev=130.90
  write: io=168232KB, bw=573522B/s, iops=139, runt=300371msec
    slat (usec): min=5, max=360, avg=18.57, stdev= 9.31
    clat (msec): min=339, max=1227, avg=727.07, stdev=168.42
     lat (msec): min=339, max=1227, avg=727.09, stdev=168.42
    clat percentiles (msec):
     |  1.00th=[  412],  5.00th=[  457], 10.00th=[  490], 20.00th=[  537],
     | 30.00th=[  594], 40.00th=[  676], 50.00th=[  783], 60.00th=[  816],
     | 70.00th=[  848], 80.00th=[  881], 90.00th=[  922], 95.00th=[  955],
     | 99.00th=[ 1012], 99.50th=[ 1037], 99.90th=[ 1106], 99.95th=[ 1221],
     | 99.99th=[ 1221]
    bw (KB  /s): min=    7, max= 1001, per=99.86%, avg=559.21, stdev=178.14
    lat (usec) : 250=0.01%
    lat (msec) : 2=0.01%, 4=0.09%, 10=2.63%, 20=4.31%, 50=4.94%
    lat (msec) : 100=6.36%, 250=10.23%, 500=27.28%, 750=16.60%, 1000=27.03%
    lat (msec) : 2000=0.67%
  cpu          : usr=0.23%, sys=0.82%, ctx=60311, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=41841/w=41943/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-write: (groupid=6, jobs=16): err= 0: pid=14723: Wed Dec 10 12:42:48 2014
  write: io=356060KB, bw=1164.1KB/s, iops=284, runt=305653msec
    slat (usec): min=5, max=23919K, avg=45125.29, stdev=507131.32
    clat (msec): min=403, max=30069, avg=7109.44, stdev=4038.41
     lat (msec): min=403, max=40105, avg=7155.32, stdev=4065.69
    clat percentiles (msec):
     |  1.00th=[ 1221],  5.00th=[ 3195], 10.00th=[ 3425], 20.00th=[ 3818],
     | 30.00th=[ 4686], 40.00th=[ 5342], 50.00th=[ 5800], 60.00th=[ 7046],
     | 70.00th=[ 7898], 80.00th=[ 9372], 90.00th=[12649], 95.00th=[15008],
     | 99.00th=[16712], 99.50th=[16712], 99.90th=[16712], 99.95th=[16712],
     | 99.99th=[16712]
    bw (KB  /s): min=    0, max=  849, per=8.75%, avg=101.87, stdev=108.70
    lat (msec) : 500=0.01%, 750=0.07%, 1000=0.11%, 2000=1.52%, >=2000=100.63%
  cpu          : usr=0.01%, sys=0.08%, ctx=957182, majf=0, minf=424
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.3%, 32=0.6%, >=64=103.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=86983/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-read: (groupid=7, jobs=16): err= 0: pid=15358: Wed Dec 10 12:42:48 2014
  write: io=346500KB, bw=1133.4KB/s, iops=276, runt=305732msec
    slat (usec): min=5, max=22705K, avg=46753.79, stdev=509037.49
    clat (msec): min=1104, max=30937, avg=7277.76, stdev=4124.57
     lat (msec): min=1104, max=30937, avg=7325.16, stdev=4149.57
    clat percentiles (msec):
     |  1.00th=[ 2933],  5.00th=[ 3261], 10.00th=[ 3490], 20.00th=[ 3916],
     | 30.00th=[ 4948], 40.00th=[ 5407], 50.00th=[ 5932], 60.00th=[ 7111],
     | 70.00th=[ 7898], 80.00th=[ 9503], 90.00th=[12780], 95.00th=[15401],
     | 99.00th=[16712], 99.50th=[16712], 99.90th=[16712], 99.95th=[16712],
     | 99.99th=[16712]
    bw (KB  /s): min=    0, max=  866, per=8.52%, avg=96.50, stdev=101.33
    lat (msec) : 2000=0.29%, >=2000=102.12%
  cpu          : usr=0.01%, sys=0.09%, ctx=949243, majf=0, minf=420
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.3%, 32=0.6%, >=64=103.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=84593/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-rw: (groupid=8, jobs=16): err= 0: pid=15940: Wed Dec 10 12:42:48 2014
  read : io=242444KB, bw=817891B/s, iops=197, runt=303540msec
    slat (usec): min=4, max=2320.4K, avg=39462.01, stdev=213885.20
    clat (msec): min=3, max=19259, avg=3165.37, stdev=2073.00
     lat (msec): min=3, max=19259, avg=3205.07, stdev=2086.30
    clat percentiles (msec):
     |  1.00th=[   90],  5.00th=[  619], 10.00th=[ 1029], 20.00th=[ 1483],
     | 30.00th=[ 1926], 40.00th=[ 2343], 50.00th=[ 2671], 60.00th=[ 3163],
     | 70.00th=[ 3752], 80.00th=[ 4752], 90.00th=[ 5932], 95.00th=[ 7373],
     | 99.00th=[ 9765], 99.50th=[10683], 99.90th=[13173], 99.95th=[13435],
     | 99.99th=[16712]
    bw (KB  /s): min=    0, max=  547, per=8.36%, avg=66.73, stdev=90.83
  write: io=244232KB, bw=823922B/s, iops=196, runt=303540msec
    slat (usec): min=6, max=2004.8K, avg=33775.97, stdev=195180.15
    clat (msec): min=3326, max=22793, avg=7077.82, stdev=2324.73
     lat (msec): min=3326, max=23760, avg=7112.03, stdev=2335.53
    clat percentiles (msec):
     |  1.00th=[ 3884],  5.00th=[ 4424], 10.00th=[ 4752], 20.00th=[ 5145],
     | 30.00th=[ 5538], 40.00th=[ 6063], 50.00th=[ 6521], 60.00th=[ 7177],
     | 70.00th=[ 7767], 80.00th=[ 8717], 90.00th=[10290], 95.00th=[11600],
     | 99.00th=[14353], 99.50th=[15533], 99.90th=[16712], 99.95th=[16712],
     | 99.99th=[16712]
    bw (KB  /s): min=    0, max=  787, per=14.16%, avg=113.87, stdev=151.68
    lat (msec) : 4=0.01%, 10=0.02%, 20=0.06%, 50=0.21%, 100=0.27%
    lat (msec) : 250=0.67%, 500=0.89%, 750=1.09%, 1000=1.58%, 2000=11.28%
    lat (msec) : >=2000=85.63%
  cpu          : usr=0.01%, sys=0.11%, ctx=1135291, majf=0, minf=455
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.4%, >=64=103.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=59978/w=59659/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-rw-pareto: (groupid=9, jobs=16): err= 0: pid=16524: Wed Dec 10 12:42:48 2014
  read : io=241356KB, bw=811816B/s, iops=196, runt=304439msec
    slat (usec): min=4, max=2075.5K, avg=40615.84, stdev=217607.40
    clat (msec): min=4, max=17551, avg=3194.92, stdev=2074.13
     lat (msec): min=4, max=18548, avg=3236.00, stdev=2086.68
    clat percentiles (msec):
     |  1.00th=[   94],  5.00th=[  701], 10.00th=[ 1090], 20.00th=[ 1549],
     | 30.00th=[ 2073], 40.00th=[ 2409], 50.00th=[ 2704], 60.00th=[ 3163],
     | 70.00th=[ 3818], 80.00th=[ 4555], 90.00th=[ 5800], 95.00th=[ 7308],
     | 99.00th=[10159], 99.50th=[11469], 99.90th=[15008], 99.95th=[15795],
     | 99.99th=[16712]
    bw (KB  /s): min=    0, max=  614, per=8.16%, avg=64.59, stdev=86.03
  write: io=243072KB, bw=817588B/s, iops=194, runt=304439msec
    slat (usec): min=6, max=1898.7K, avg=32969.05, stdev=189684.97
    clat (msec): min=3387, max=22869, avg=7151.83, stdev=2312.85
     lat (msec): min=3387, max=22869, avg=7185.14, stdev=2323.15
    clat percentiles (msec):
     |  1.00th=[ 3949],  5.00th=[ 4424], 10.00th=[ 4817], 20.00th=[ 5211],
     | 30.00th=[ 5669], 40.00th=[ 6128], 50.00th=[ 6652], 60.00th=[ 7308],
     | 70.00th=[ 7832], 80.00th=[ 8717], 90.00th=[10421], 95.00th=[11469],
     | 99.00th=[15008], 99.50th=[15926], 99.90th=[16712], 99.95th=[16712],
     | 99.99th=[16712]
    bw (KB  /s): min=    0, max=  809, per=13.09%, avg=104.47, stdev=135.69
    lat (msec) : 10=0.01%, 20=0.04%, 50=0.20%, 100=0.28%, 250=0.68%
    lat (msec) : 500=0.78%, 750=0.77%, 1000=1.58%, 2000=10.10%, >=2000=87.27%
  cpu          : usr=0.01%, sys=0.11%, ctx=1135896, majf=0, minf=693
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.4%, >=64=103.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=59733/w=59342/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-80-20: (groupid=10, jobs=16): err= 0: pid=17097: Wed Dec 10 12:42:48 2014
  read : io=573392KB, bw=1886.9KB/s, iops=468, runt=303894msec
    slat (usec): min=4, max=2960.5K, avg=26486.18, stdev=186841.63
    clat (msec): min=3, max=8595, avg=2181.84, stdev=1220.61
     lat (msec): min=3, max=8603, avg=2208.56, stdev=1238.25
    clat percentiles (msec):
     |  1.00th=[   50],  5.00th=[  322], 10.00th=[  701], 20.00th=[ 1123],
     | 30.00th=[ 1418], 40.00th=[ 1680], 50.00th=[ 2024], 60.00th=[ 2442],
     | 70.00th=[ 2835], 80.00th=[ 3261], 90.00th=[ 3851], 95.00th=[ 4293],
     | 99.00th=[ 5211], 99.50th=[ 5604], 99.90th=[ 6980], 99.95th=[ 7308],
     | 99.99th=[ 7963]
    bw (KB  /s): min=    0, max= 1104, per=7.74%, avg=145.95, stdev=155.62
  write: io=147076KB, bw=495586B/s, iops=117, runt=303894msec
    slat (usec): min=4, max=1545.4K, avg=23605.34, stdev=139088.02
    clat (msec): min=3300, max=14749, avg=8466.60, stdev=1309.51
     lat (msec): min=3300, max=15760, avg=8490.51, stdev=1326.81
    clat percentiles (msec):
     |  1.00th=[ 5669],  5.00th=[ 6587], 10.00th=[ 6915], 20.00th=[ 7373],
     | 30.00th=[ 7767], 40.00th=[ 8094], 50.00th=[ 8356], 60.00th=[ 8717],
     | 70.00th=[ 8979], 80.00th=[ 9503], 90.00th=[10159], 95.00th=[10683],
     | 99.00th=[11994], 99.50th=[12518], 99.90th=[13566], 99.95th=[13829],
     | 99.99th=[14484]
    bw (KB  /s): min=    0, max=  367, per=12.53%, avg=60.54, stdev=59.84
    lat (msec) : 4=0.01%, 10=0.02%, 20=0.11%, 50=0.69%, 100=0.97%
    lat (msec) : 250=1.58%, 500=2.48%, 750=2.84%, 1000=4.45%, 2000=26.90%
    lat (msec) : >=2000=61.10%
  cpu          : usr=0.01%, sys=0.07%, ctx=594446, majf=0, minf=454
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.3%, >=64=103.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=142322/w=35763/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
streaming-write: (groupid=11, jobs=16): err= 0: pid=17675: Wed Dec 10 12:42:48 2014
  write: io=43570MB, bw=148680KB/s, iops=37163, runt=300077msec
    slat (usec): min=4, max=432321, avg=43.67, stdev=2666.30
    clat (usec): min=132, max=650346, avg=55047.05, stdev=49400.98
     lat (usec): min=146, max=650353, avg=55092.15, stdev=49478.68
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    8], 10.00th=[   12], 20.00th=[   21],
     | 30.00th=[   29], 40.00th=[   37], 50.00th=[   45], 60.00th=[   54],
     | 70.00th=[   65], 80.00th=[   80], 90.00th=[  102], 95.00th=[  127],
     | 99.00th=[  293], 99.50th=[  334], 99.90th=[  420], 99.95th=[  453],
     | 99.99th=[  502]
    bw (KB  /s): min=    0, max=24380, per=6.29%, avg=9349.83, stdev=2640.87
    lat (usec) : 250=0.04%, 500=0.04%, 750=0.04%, 1000=0.05%
    lat (msec) : 2=0.33%, 4=1.36%, 10=6.17%, 20=10.95%, 50=37.29%
    lat (msec) : 100=33.27%, 250=8.89%, 500=1.58%, 750=0.01%
  cpu          : usr=0.79%, sys=2.98%, ctx=896499, majf=0, minf=456
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=105.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=11151817/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
streaming-read: (groupid=12, jobs=16): err= 0: pid=18254: Wed Dec 10 12:42:48 2014
  read : io=61754MB, bw=210710KB/s, iops=52670, runt=300112msec
    slat (usec): min=3, max=1410, avg= 8.47, stdev= 9.61
    clat (usec): min=1, max=895924, avg=38862.74, stdev=52037.98
     lat (usec): min=110, max=895929, avg=38871.27, stdev=52037.56
    clat percentiles (usec):
     |  1.00th=[  756],  5.00th=[ 1576], 10.00th=[ 2320], 20.00th=[ 4192],
     | 30.00th=[ 7456], 40.00th=[12864], 50.00th=[19584], 60.00th=[28032],
     | 70.00th=[41216], 80.00th=[62720], 90.00th=[102912], 95.00th=[142336],
     | 99.00th=[244736], 99.50th=[288768], 99.90th=[403456], 99.95th=[452608],
     | 99.99th=[610304]
    bw (KB  /s): min=    0, max=57843, per=6.31%, avg=13293.16, stdev=7921.15
    lat (usec) : 2=0.01%, 50=0.01%, 100=0.01%, 250=0.07%, 500=0.29%
    lat (usec) : 750=0.61%, 1000=0.92%
    lat (msec) : 2=5.90%, 4=11.45%, 10=15.79%, 20=15.65%, 50=24.05%
    lat (msec) : 100=14.85%, 250=9.52%, 500=0.89%, 750=0.03%, 1000=0.01%
  cpu          : usr=0.79%, sys=4.17%, ctx=1197630, majf=0, minf=2511
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=110.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=15807108/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
streaming-rw: (groupid=13, jobs=16): err= 0: pid=18839: Wed Dec 10 12:42:48 2014
  read : io=8609.6MB, bw=29299KB/s, iops=7320, runt=300898msec
    slat (usec): min=3, max=521457, avg=885.99, stdev=11864.74
    clat (usec): min=1, max=1444.7K, avg=165342.64, stdev=147498.63
     lat (usec): min=108, max=1576.1K, avg=166230.47, stdev=148268.38
    clat percentiles (usec):
     |  1.00th=[  652],  5.00th=[ 3440], 10.00th=[11584], 20.00th=[34560],
     | 30.00th=[63232], 40.00th=[96768], 50.00th=[132096], 60.00th=[171008],
     | 70.00th=[216064], 80.00th=[272384], 90.00th=[362496], 95.00th=[448512],
     | 99.00th=[643072], 99.50th=[716800], 99.90th=[897024], 99.95th=[987136],
     | 99.99th=[1138688]
    bw (KB  /s): min=    0, max= 9634, per=6.32%, avg=1852.47, stdev=777.06
  write: io=980688KB, bw=3259.3KB/s, iops=812, runt=300898msec
    slat (usec): min=5, max=449953, avg=2112.40, stdev=17452.96
    clat (msec): min=390, max=2196, avg=1018.40, stdev=224.11
     lat (msec): min=390, max=2196, avg=1020.56, stdev=224.35
    clat percentiles (msec):
     |  1.00th=[  586],  5.00th=[  693], 10.00th=[  750], 20.00th=[  824],
     | 30.00th=[  889], 40.00th=[  947], 50.00th=[  996], 60.00th=[ 1057],
     | 70.00th=[ 1123], 80.00th=[ 1205], 90.00th=[ 1319], 95.00th=[ 1418],
     | 99.00th=[ 1614], 99.50th=[ 1713], 99.90th=[ 1909], 99.95th=[ 2008],
     | 99.99th=[ 2073]
    bw (KB  /s): min=    0, max=  785, per=6.37%, avg=207.74, stdev=104.51
    lat (usec) : 2=0.01%, 100=0.01%, 250=0.21%, 500=0.42%, 750=0.46%
    lat (usec) : 1000=0.45%
    lat (msec) : 2=1.54%, 4=1.88%, 10=3.19%, 20=4.71%, 50=10.19%
    lat (msec) : 100=13.80%, 250=31.86%, 500=18.34%, 750=3.70%, 1000=4.32%
    lat (msec) : 2000=5.02%, >=2000=0.01%
  cpu          : usr=0.16%, sys=0.76%, ctx=1249140, majf=0, minf=469
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=2202811/w=244367/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=52476MB, aggrb=177386KB/s, minb=177386KB/s, maxb=177386KB/s, mint=302929msec, maxt=302929msec

Run status group 1 (all jobs):
   READ: io=78288MB, aggrb=266560KB/s, minb=266560KB/s, maxb=266560KB/s, mint=300746msec, maxt=300746msec

Run status group 2 (all jobs):
   READ: io=30212MB, aggrb=102310KB/s, minb=102310KB/s, maxb=102310KB/s, mint=302385msec, maxt=302385msec
  WRITE: io=30896MB, aggrb=104626KB/s, minb=104626KB/s, maxb=104626KB/s, mint=302385msec, maxt=302385msec

Run status group 3 (all jobs):
  WRITE: io=244852KB, aggrb=814KB/s, minb=814KB/s, maxb=814KB/s, mint=300645msec, maxt=300645msec

Run status group 4 (all jobs):
  WRITE: io=244776KB, aggrb=814KB/s, minb=814KB/s, maxb=814KB/s, mint=300525msec, maxt=300525msec

Run status group 5 (all jobs):
   READ: io=167412KB, aggrb=557KB/s, minb=557KB/s, maxb=557KB/s, mint=300371msec, maxt=300371msec
  WRITE: io=168232KB, aggrb=560KB/s, minb=560KB/s, maxb=560KB/s, mint=300371msec, maxt=300371msec

Run status group 6 (all jobs):
  WRITE: io=356060KB, aggrb=1164KB/s, minb=1164KB/s, maxb=1164KB/s, mint=305653msec, maxt=305653msec

Run status group 7 (all jobs):
  WRITE: io=346500KB, aggrb=1133KB/s, minb=1133KB/s, maxb=1133KB/s, mint=305732msec, maxt=305732msec

Run status group 8 (all jobs):
   READ: io=242444KB, aggrb=798KB/s, minb=798KB/s, maxb=798KB/s, mint=303540msec, maxt=303540msec
  WRITE: io=244232KB, aggrb=804KB/s, minb=804KB/s, maxb=804KB/s, mint=303540msec, maxt=303540msec

Run status group 9 (all jobs):
   READ: io=241356KB, aggrb=792KB/s, minb=792KB/s, maxb=792KB/s, mint=304439msec, maxt=304439msec
  WRITE: io=243072KB, aggrb=798KB/s, minb=798KB/s, maxb=798KB/s, mint=304439msec, maxt=304439msec

Run status group 10 (all jobs):
   READ: io=573392KB, aggrb=1886KB/s, minb=1886KB/s, maxb=1886KB/s, mint=303894msec, maxt=303894msec
  WRITE: io=147076KB, aggrb=483KB/s, minb=483KB/s, maxb=483KB/s, mint=303894msec, maxt=303894msec

Run status group 11 (all jobs):
  WRITE: io=43570MB, aggrb=148679KB/s, minb=148679KB/s, maxb=148679KB/s, mint=300077msec, maxt=300077msec

Run status group 12 (all jobs):
   READ: io=61754MB, aggrb=210709KB/s, minb=210709KB/s, maxb=210709KB/s, mint=300112msec, maxt=300112msec

Run status group 13 (all jobs):
   READ: io=8609.6MB, aggrb=29299KB/s, minb=29299KB/s, maxb=29299KB/s, mint=300898msec, maxt=300898msec
  WRITE: io=980688KB, aggrb=3259KB/s, minb=3259KB/s, maxb=3259KB/s, mint=300898msec, maxt=300898msec

Additional Terse Output:
3;fio-2.1.10;seq-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;53735424;177386;42;302929;1240;1473397;11558.770637;78506.922738;2037311;5350692;2956003.639835;225765.205008;1.000000%=2572288;5.000000%=2768896;10.000000%=2834432;20.000000%=2867200;30.000000%=2867200;40.000000%=2899968;50.000000%=2932736;60.000000%=2965504;70.000000%=2998272;80.000000%=3031040;90.000000%=3096576;95.000000%=3129344;99.000000%=3883008;99.500000%=4489216;99.900000%=5341184;99.950000%=5341184;99.990000%=5341184;0%=0;0%=0;0%=0;2038903;5352474;2967664.114872;231023.967786;408;457788;100.000000%;220104.563855;157708.767579;5.963463%;2.100169%;55186;0;25;0.1%;0.1%;0.1%;0.1%;0.1%;0.2%;103.9%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;100.98%
3;fio-2.1.10;seq-read;1;0;80166912;266560;64;300746;367;345403;15270.436442;37505.972626;646780;4392709;1954015.965665;477008.965571;1.000000%=880640;5.000000%=1089536;10.000000%=1318912;20.000000%=1515520;30.000000%=1630208;40.000000%=1761280;50.000000%=1957888;60.000000%=2375680;70.000000%=2441216;80.000000%=2441216;90.000000%=2441216;95.000000%=2441216;99.000000%=2605056;99.500000%=2670592;99.900000%=2801664;99.950000%=2899968;99.990000%=3358720;0%=0;0%=0;0%=0;732433;4393175;1969409.736154;481672.388195;407;532480;98.682087%;263046.970315;91223.674668;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.020615%;2.814677%;3357;0;797;0.1%;0.1%;0.1%;0.1%;0.2%;0.3%;103.5%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.03%;3.39%;48.37%;48.86%
3;fio-2.1.10;seq-rw;2;0;30937088;102310;24;302385;351;1337718;21459.135345;89239.375421;19788;3795238;726507.647822;364706.469000;1.000000%=55552;5.000000%=232448;10.000000%=362496;20.000000%=464896;30.000000%=536576;40.000000%=602112;50.000000%=675840;60.000000%=749568;70.000000%=831488;80.000000%=954368;90.000000%=1171456;95.000000%=1384448;99.000000%=1761280;99.500000%=1925120;99.900000%=3522560;99.950000%=3522560;99.990000%=3784704;0%=0;0%=0;0%=0;20222;3795694;748095.752151;373432.515079;382;350852;100.000000%;111431.549145;57488.951660;31637504;104626;25;302385;1028;774021;5477.019392;43173.341588;2692693;7870708;4320452.499223;458261.028123;1.000000%=3325952;5.000000%=3653632;10.000000%=3784704;20.000000%=3981312;30.000000%=4079616;40.000000%=4227072;50.000000%=4292608;60.000000%=4423680;70.000000%=4554752;80.000000%=4685824;90.000000%=4882432;95.000000%=5013504;99.000000%=5406720;99.500000%=6258688;99.900000%=7110656;99.950000%=7438336;99.990000%=7897088;0%=0;0%=0;0%=0;2693873;7871929;4325982.160280;459796.249701;2310;435744;100.000000%;120391.318681;92773.766577;2.147270%;2.309315%;19321;0;26;0.1%;0.1%;0.1%;0.1%;0.1%;0.2%;103.5%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.44%;0.44%;1.80%;9.78%;17.72%;11.17%;8.32%;51.16%
3;fio-2.1.10;rand-write;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;244852;814;203;300645;5;310;13.012901;9.120374;277937;1232735;629356.784033;51662.597988;1.000000%=468992;5.000000%=577536;10.000000%=585728;20.000000%=602112;30.000000%=610304;40.000000%=618496;50.000000%=626688;60.000000%=634880;70.000000%=643072;80.000000%=659456;90.000000%=675840;95.000000%=700416;99.000000%=765952;99.500000%=864256;99.900000%=987136;99.950000%=1171456;99.990000%=1171456;0%=0;0%=0;0%=0;277971;1232758;629370.090455;51662.111664;0;1000;100.000000%;815.450939;78.017708;0.128724%;0.397147%;31141;0;23;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;103.4%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;1.18%;97.88%;1.05%;0.10%;0.00%
3;fio-2.1.10;rand-read;4;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;244776;814;203;300525;5;380;12.320340;8.902640;270490;1063238;629457.393029;47060.061880;1.000000%=544768;5.000000%=577536;10.000000%=585728;20.000000%=602112;30.000000%=610304;40.000000%=618496;50.000000%=626688;60.000000%=634880;70.000000%=643072;80.000000%=659456;90.000000%=675840;95.000000%=700416;99.000000%=765952;99.500000%=815104;99.900000%=1011712;99.950000%=1011712;99.990000%=1011712;0%=0;0%=0;0%=0;270522;1063247;629470.007958;47059.421878;0;998;100.000000%;815.242171;69.730352;0.114134%;0.399303%;31541;0;24;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;103.5%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.85%;98.18%;1.06%;0.11%;0.00%
3;fio-2.1.10;rand-rw;5;0;167412;557;139;300371;5;312;20.716873;10.376360;237;718097;189322.852149;133117.675653;1.000000%=5728;5.000000%=9664;10.000000%=13888;20.000000%=35584;30.000000%=71168;40.000000%=118272;50.000000%=218112;60.000000%=259072;70.000000%=288768;80.000000%=317440;90.000000%=354304;95.000000%=382976;99.000000%=444416;99.500000%=464896;99.900000%=528384;99.950000%=552960;99.990000%=634880;0%=0;0%=0;0%=0;263;718113;189343.968437;133114.778747;0;896;100.000000%;565.283422;130.902021;168232;560;139;300371;5;360;18.567984;9.314618;339779;1227346;727072.187574;168423.101668;1.000000%=411648;5.000000%=456704;10.000000%=489472;20.000000%=536576;30.000000%=593920;40.000000%=675840;50.000000%=782336;60.000000%=815104;70.000000%=847872;80.000000%=880640;90.000000%=921600;95.000000%=954368;99.000000%=1011712;99.500000%=1036288;99.900000%=1105920;99.950000%=1220608;99.990000%=1220608;0%=0;0%=0;0%=0;339798;1227358;727091.115840;168420.963694;7;1001;99.858165%;559.205725;178.139053;0.226387%;0.816659%;60311;0;27;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;103.3%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.01%;0.09%;2.63%;4.31%;4.94%;6.36%;10.23%;27.28%;16.60%;27.03%;0.67%;0.00%
3;fio-2.1.10;threaded-write;6;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;356060;1164;284;305653;5;23918576;45125.290652;507131.318359;403712;30069886;7109443.973656;4038406.561471;1.000000%=1220608;5.000000%=3194880;10.000000%=3424256;20.000000%=3817472;30.000000%=4685824;40.000000%=5341184;50.000000%=5799936;60.000000%=7045120;70.000000%=7897088;80.000000%=9371648;90.000000%=12648448;95.000000%=15007744;99.000000%=16711680;99.500000%=16711680;99.900000%=16711680;99.950000%=16711680;99.990000%=16711680;0%=0;0%=0;0%=0;403727;40105826;7155317.278908;4065690.049798;0;849;8.751830%;101.871307;108.703000;0.009487%;0.084144%;957182;0;424;0.1%;0.1%;0.1%;0.1%;0.3%;0.6%;103.7%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.07%;0.11%;1.52%;100.63%
3;fio-2.1.10;threaded-read;7;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;346500;1133;276;305732;5;22705003;46753.793529;509037.486162;1104939;30937934;7277760.184439;4124567.042481;1.000000%=2932736;5.000000%=3260416;10.000000%=3489792;20.000000%=3915776;30.000000%=4947968;40.000000%=5406720;50.000000%=5931008;60.000000%=7110656;70.000000%=7897088;80.000000%=9502720;90.000000%=12779520;95.000000%=15400960;99.000000%=16711680;99.500000%=16711680;99.900000%=16711680;99.950000%=16711680;99.990000%=16711680;0%=0;0%=0;0%=0;1104955;30937942;7325158.314113;4149571.408727;0;866;8.517269%;96.500654;101.327696;0.009857%;0.085361%;949243;0;420;0.1%;0.1%;0.1%;0.2%;0.3%;0.6%;103.8%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.29%;102.12%
3;fio-2.1.10;threaded-rw;8;0;242444;798;197;303540;4;2320319;39462.013241;213885.195681;3768;19259540;3165374.737836;2073000.352275;1.000000%=89600;5.000000%=618496;10.000000%=1028096;20.000000%=1482752;30.000000%=1925120;40.000000%=2342912;50.000000%=2670592;60.000000%=3162112;70.000000%=3751936;80.000000%=4751360;90.000000%=5931008;95.000000%=7372800;99.000000%=9764864;99.500000%=10682368;99.900000%=13172736;99.950000%=13434880;99.990000%=16711680;0%=0;0%=0;0%=0;3789;19259547;3205071.113742;2086298.016523;0;547;8.362489%;66.732660;90.833251;244232;804;196;303540;6;2004720;33775.970588;195180.153865;3326601;22793767;7077824.561515;2324732.523905;1.000000%=3883008;5.000000%=4423680;10.000000%=4751360;20.000000%=5144576;30.000000%=5537792;40.000000%=6062080;50.000000%=6520832;60.000000%=7176192;70.000000%=7766016;80.000000%=8716288;90.000000%=10289152;95.000000%=11599872;99.000000%=14352384;99.500000%=15532032;99.900000%=16711680;99.950000%=16711680;99.990000%=16711680;0%=0;0%=0;0%=0;3326609;23760730;7112034.341086;2335525.805843;0;787;14.162738%;113.868410;151.684813;0.012675%;0.105520%;1135291;0;455;0.1%;0.1%;0.1%;0.1%;0.2%;0.4%;103.4%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.02%;0.06%;0.21%;0.27%;0.67%;0.89%;1.09%;1.58%;11.28%;85.63%
3;fio-2.1.10;threaded-rw-pareto;9;0;241356;792;196;304439;4;2075500;40615.844449;217607.404920;4367;17551546;3194919.534033;2074127.553850;1.000000%=93696;5.000000%=700416;10.000000%=1089536;20.000000%=1548288;30.000000%=2072576;40.000000%=2408448;50.000000%=2703360;60.000000%=3162112;70.000000%=3817472;80.000000%=4554752;90.000000%=5799936;95.000000%=7307264;99.000000%=10158080;99.500000%=11468800;99.900000%=15007744;99.950000%=15794176;99.990000%=16711680;0%=0;0%=0;0%=0;4379;18548796;3236001.641708;2086684.490999;0;614;8.155522%;64.591736;86.031404;243072;798;194;304439;6;1898627;32969.053790;189684.966008;3387378;22869374;7151827.764629;2312849.932464;1.000000%=3948544;5.000000%=4423680;10.000000%=4816896;20.000000%=5210112;30.000000%=5668864;40.000000%=6127616;50.000000%=6651904;60.000000%=7307264;70.000000%=7831552;80.000000%=8716288;90.000000%=10420224;95.000000%=11468800;99.000000%=15007744;99.500000%=15925248;99.900000%=16711680;99.950000%=16711680;99.990000%=16711680;0%=0;0%=0;0%=0;3387388;22869382;7185135.267032;2323147.398590;0;809;13.091421%;104.469540;135.691786;0.012236%;0.106508%;1135896;0;693;0.1%;0.1%;0.1%;0.1%;0.2%;0.4%;103.4%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.04%;0.20%;0.28%;0.68%;0.78%;0.77%;1.58%;10.10%;87.27%
3;fio-2.1.10;threaded-80-20;10;0;573392;1886;468;303894;4;2960437;26486.177246;186841.634368;3490;8595259;2181841.445566;1220607.531217;1.000000%=49408;5.000000%=321536;10.000000%=700416;20.000000%=1122304;30.000000%=1417216;40.000000%=1679360;50.000000%=2023424;60.000000%=2441216;70.000000%=2834432;80.000000%=3260416;90.000000%=3850240;95.000000%=4292608;99.000000%=5210112;99.500000%=5603328;99.900000%=6979584;99.950000%=7307264;99.990000%=7962624;0%=0;0%=0;0%=0;3498;8603282;2208559.173773;1238245.741492;0;1104;7.738750%;145.952821;155.624679;147076;483;117;303894;4;1545328;23605.341638;139088.015268;3300470;14749120;8466596.816285;1309512.795626;1.000000%=5668864;5.000000%=6586368;10.000000%=6914048;20.000000%=7372800;30.000000%=7766016;40.000000%=8093696;50.000000%=8355840;60.000000%=8716288;70.000000%=8978432;80.000000%=9502720;90.000000%=10158080;95.000000%=10682368;99.000000%=11993088;99.500000%=12517376;99.900000%=13565952;99.950000%=13828096;99.990000%=14483456;0%=0;0%=0;0%=0;3300478;15760624;8490509.136229;1326811.552489;0;367;12.534297%;60.540654;59.835983;0.012437%;0.071802%;594446;0;454;0.1%;0.1%;0.1%;0.1%;0.1%;0.3%;103.4%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.02%;0.11%;0.69%;0.97%;1.58%;2.48%;2.84%;4.45%;26.90%;61.10%
3;fio-2.1.10;streaming-write;11;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;44615396;148679;37163;300077;4;432321;43.667090;2666.296141;132;650346;55047.046416;49400.980253;1.000000%=2832;5.000000%=7136;10.000000%=11840;20.000000%=20864;30.000000%=28800;40.000000%=36096;50.000000%=44288;60.000000%=53504;70.000000%=64768;80.000000%=79360;90.000000%=101888;95.000000%=126464;99.000000%=292864;99.500000%=333824;99.900000%=419840;99.950000%=452608;99.990000%=501760;0%=0;0%=0;0%=0;146;650353;55092.148883;49478.676346;0;24380;6.288600%;9349.827206;2640.868292;0.794969%;2.983523%;896499;0;456;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;105.3%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.04%;0.04%;0.04%;0.05%;0.33%;1.36%;6.17%;10.95%;37.29%;33.27%;8.89%;1.58%;0.01%;0.00%;0.00%;0.00%
3;fio-2.1.10;streaming-read;12;0;63236560;210709;52670;300112;3;1410;8.470933;9.614069;1;895924;38862.743800;52037.980554;1.000000%=756;5.000000%=1576;10.000000%=2320;20.000000%=4192;30.000000%=7456;40.000000%=12864;50.000000%=19584;60.000000%=28032;70.000000%=41216;80.000000%=62720;90.000000%=102912;95.000000%=142336;99.000000%=244736;99.500000%=288768;99.900000%=403456;99.950000%=452608;99.990000%=610304;0%=0;0%=0;0%=0;110;895929;38871.271776;52037.558602;0;57843;6.308775%;13293.156027;7921.149280;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.787611%;4.169072%;1197630;0;2511;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;110.3%;0.01%;0.00%;0.00%;0.00%;0.01%;0.01%;0.07%;0.29%;0.61%;0.92%;5.90%;11.45%;15.79%;15.65%;24.05%;14.85%;9.52%;0.89%;0.03%;0.01%;0.00%;0.00%
3;fio-2.1.10;streaming-rw;13;0;8816152;29299;7320;300898;3;521457;885.988035;11864.736757;1;1444636;165342.635376;147498.627929;1.000000%=652;5.000000%=3440;10.000000%=11584;20.000000%=34560;30.000000%=63232;40.000000%=96768;50.000000%=132096;60.000000%=171008;70.000000%=216064;80.000000%=272384;90.000000%=362496;95.000000%=448512;99.000000%=643072;99.500000%=716800;99.900000%=897024;99.950000%=987136;99.990000%=1138688;0%=0;0%=0;0%=0;108;1576963;166230.471539;148268.380239;0;9634;6.322625%;1852.465863;777.062685;980688;3259;812;300898;5;449953;2112.396999;17452.958935;390119;2196275;1018395.307784;224113.502913;1.000000%=585728;5.000000%=692224;10.000000%=749568;20.000000%=823296;30.000000%=888832;40.000000%=946176;50.000000%=995328;60.000000%=1056768;70.000000%=1122304;80.000000%=1204224;90.000000%=1318912;95.000000%=1417216;99.000000%=1613824;99.500000%=1712128;99.900000%=1908736;99.950000%=2007040;99.990000%=2072576;0%=0;0%=0;0%=0;390132;2196291;1020557.664509;224350.450028;0;785;6.374468%;207.743927;104.506646;0.158803%;0.764462%;1249140;0;469;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;103.7%;0.01%;0.00%;0.00%;0.00%;0.00%;0.01%;0.21%;0.42%;0.46%;0.45%;1.54%;1.88%;3.19%;4.71%;10.19%;13.80%;31.86%;18.34%;3.70%;4.32%;5.02%;0.01%